borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/version.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/task_wdt/task_wdt.h>
#include <hal/nrf_clock.h>
#include <hal/nrf_power.h>

#if defined(CONFIG_USB_DEVICE_STACK)
#include <zephyr/usb/usb_device.h>
#endif

#include "mb_vm.h"
#include "mb_scheduler.h"

/*
 * Module: OS/II Zephyr runtime (nRF52840 / Nano 33 BLE Sense path)
 *
 * Responsibilities:
 * - Bring up USB logging + optional sensor power rails and I2C pull-ups.
 * - Build/execute a small register-VM bytecode program that consumes mailbox
 *   commands and dispatches BIFs (I2C read, PWM set duty, monotonic timestamp).
 * - Periodically enqueue sensor read commands and PWM actuator commands.
 * - Emit stable event logs (sensor_event / actuator_event) using schema v1.
 * - Apply bounded-mailbox backpressure, retry/degraded policy, and watchdog
 *   recovery when degraded state persists beyond grace period.
 */

LOG_MODULE_REGISTER(mini_beam_nrf52, LOG_LEVEL_INF);

/* Locked event schema constants (v2). Keep in sync with contract doc. */
#define OS2_EVENT_SCHEMA_VERSION 2
#define OS2_EVENT_STATUS_OK 0
#define OS2_EVENT_STATUS_IO_ERROR 1
#define OS2_EVENT_STATUS_BAD_ARGUMENT 2
#define OS2_EVENT_STATUS_INTERNAL_ERROR 3
#define OS2_EVENT_STATUS_RETRYING 4
#define OS2_EVENT_STATUS_DEGRADED 5
#define OS2_EVENT_STATUS_RECOVERED 6

/* VM register mapping used by cyclic sensor/actuator routine. */
#define OS2_REG_CMD_TYPE 0
#define OS2_REG_BUS 1
#define OS2_REG_ADDR 2
#define OS2_REG_REG 3
#define OS2_REG_SENSOR_ID 9
#define OS2_REG_VALUE 7
#define OS2_REG_TS 8
#define OS2_REG_EVENT_MARK 10
#define OS2_REG_EVT_BUS 11
#define OS2_REG_EVT_ADDR 12
#define OS2_REG_EVT_REG 13
#define OS2_REG_CMD_PWM_SET_DUTY 14
#define OS2_REG_TMP 15

/* Mailbox backpressure policy (v1): reject new command when mailbox is full. */
#define OS2_MB_POLICY_REJECT_NEW 1
#define OS2_STATS_LOG_PERIOD_MS 5000U
#define OS2_RETRY_LIMIT 2U
#define OS2_RETRY_BACKOFF_MS 200U
#define OS2_DEGRADED_BACKOFF_MS 2000U
#define OS2_WDT_TIMEOUT_MS 6000U
#define OS2_WDT_DEGRADED_GRACE_MS 10000U
#define OS2_PWM_PERIOD_MS 1000U
#define OS2_PWM_CHANNEL 0U
#define OS2_PWM_ACTUATOR_ID 1U
#ifndef OS2_ENABLE_TASK_WDT
#define OS2_ENABLE_TASK_WDT 1
#endif

/* Locked board capability schema (v1), encoded as Erlang term text in logs. */
#define OS2_CAPS_SCHEMA_VERSION 1U
#define OS2_BOARD_ATOM "arduino_nano_33_ble_sense"
#define OS2_VM_ATOM "mini_beam"
#define OS2_SPI_MASTERS 4U
#define OS2_PWM_CHANNELS 4U
#define OS2_ADC_CHANNELS 8U
#define OS2_ADC_MAX_KSPS 200U
#define OS2_RTC_COUNT 3U
#define OS2_TIMER32_COUNT 5U
#define OS2_HAS_QDEC 1U
#define OS2_HAS_I2S 1U
#define OS2_HAS_PDM 1U
#define OS2_HAS_BLE 1U
#define OS2_HAS_EASYDMA 1U

/* Set >0 to inject a synthetic read failure every Nth sensor read. */
#ifndef OS2_FAULT_EVERY_N
#define OS2_FAULT_EVERY_N 0
#endif

#if DT_NODE_HAS_STATUS(DT_ALIAS(i2c0), okay)
#define OS2_I2C0_NODE DT_ALIAS(i2c0)
#elif DT_NODE_HAS_STATUS(DT_NODELABEL(i2c0), okay)
#define OS2_I2C0_NODE DT_NODELABEL(i2c0)
#endif

#if defined(OS2_I2C0_NODE)
static const struct device *const os2_i2c0 = DEVICE_DT_GET(OS2_I2C0_NODE);
#define OS2_HAS_I2C0 1
#else
#define OS2_HAS_I2C0 0
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(i2c1), okay)
static const struct device *const os2_i2c1 = DEVICE_DT_GET(DT_NODELABEL(i2c1));
#define OS2_HAS_I2C1 1
#else
#define OS2_HAS_I2C1 0
#endif

#if DT_NODE_EXISTS(DT_PATH(zephyr_user)) && DT_NODE_HAS_PROP(DT_PATH(zephyr_user), pull_up_gpios)
static const struct gpio_dt_spec os2_i2c_pullup =
    GPIO_DT_SPEC_GET(DT_PATH(zephyr_user), pull_up_gpios);
#define OS2_HAS_I2C_PULLUP 1
#else
#define OS2_HAS_I2C_PULLUP 0
#endif

#if DT_NODE_EXISTS(DT_PATH(vdd_env)) && DT_NODE_HAS_PROP(DT_PATH(vdd_env), enable_gpios)
static const struct gpio_dt_spec os2_vdd_env_en =
    GPIO_DT_SPEC_GET(DT_PATH(vdd_env), enable_gpios);
#define OS2_HAS_VDD_ENV_EN 1
#else
#define OS2_HAS_VDD_ENV_EN 0
#endif

#if DT_NODE_EXISTS(DT_PATH(mic_pwr)) && DT_NODE_HAS_PROP(DT_PATH(mic_pwr), enable_gpios)
static const struct gpio_dt_spec os2_mic_pwr_en =
    GPIO_DT_SPEC_GET(DT_PATH(mic_pwr), enable_gpios);
#define OS2_HAS_MIC_PWR_EN 1
#else
#define OS2_HAS_MIC_PWR_EN 0
#endif

#if OS2_HAS_VDD_ENV_EN && OS2_HAS_MIC_PWR_EN
#define OS2_POWER_DOMAINS_ATOMS "[vdd_env,mic_pwr]"
#elif OS2_HAS_VDD_ENV_EN
#define OS2_POWER_DOMAINS_ATOMS "[vdd_env]"
#elif OS2_HAS_MIC_PWR_EN
#define OS2_POWER_DOMAINS_ATOMS "[mic_pwr]"
#else
#define OS2_POWER_DOMAINS_ATOMS "[]"
#endif

#define OS2_I2C_BUS_COUNT ((uint8_t)(OS2_HAS_I2C0 + OS2_HAS_I2C1))

typedef struct {
    uint8_t caps_v;
    const char *board_atom;
    const char *vm_atom;
    uint8_t event_schema_v;
    uint8_t i2c_buses;
    uint8_t spi_masters;
    uint8_t pwm_channels;
    uint8_t adc_channels;
    uint16_t adc_max_ksps;
    uint8_t rtc_count;
    uint8_t timer32_count;
    uint8_t has_qdec;
    uint8_t has_i2s;
    uint8_t has_pdm;
    uint8_t has_ble;
    uint8_t has_easydma;
    uint8_t mailbox_depth;
    uint32_t wdt_timeout_ms;
    const char *policy_atom;
    const char *power_domains_atoms;
} os2_caps_v1_t;

static const os2_caps_v1_t os2_caps_v1 = {
    .caps_v = OS2_CAPS_SCHEMA_VERSION,
    .board_atom = OS2_BOARD_ATOM,
    .vm_atom = OS2_VM_ATOM,
    .event_schema_v = OS2_EVENT_SCHEMA_VERSION,
    .i2c_buses = OS2_I2C_BUS_COUNT,
    .spi_masters = OS2_SPI_MASTERS,
    .pwm_channels = OS2_PWM_CHANNELS,
    .adc_channels = OS2_ADC_CHANNELS,
    .adc_max_ksps = OS2_ADC_MAX_KSPS,
    .rtc_count = OS2_RTC_COUNT,
    .timer32_count = OS2_TIMER32_COUNT,
    .has_qdec = OS2_HAS_QDEC,
    .has_i2s = OS2_HAS_I2S,
    .has_pdm = OS2_HAS_PDM,
    .has_ble = OS2_HAS_BLE,
    .has_easydma = OS2_HAS_EASYDMA,
    .mailbox_depth = MB_MAILBOX_CAPACITY,
    .wdt_timeout_ms = OS2_WDT_TIMEOUT_MS,
    .policy_atom = "reject_new",
    .power_domains_atoms = OS2_POWER_DOMAINS_ATOMS,
};

