borodark/OS-II/erts/example/mini_beam_esp32/zephyr_app/src/main.c
#if defined(CONFIG_USB_DEVICE_STACK)
    {
        const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
        uint32_t dtr = 0;
        int wait_ms = 0;

        /* Bring up USB CDC ACM so logs are visible on /dev/ttyACM*. */
        (void)usb_enable(NULL);
        while (wait_ms < 3000U) {
            if (uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr) == 0 && dtr) {
                break;
            }
            k_msleep(100);
            wait_ms += 100;
        }
    }
#endif

    LOG_INF("mini_beam_nrf52 start");
    LOG_INF("event schema v%d", OS2_EVENT_SCHEMA_VERSION);
    os2_log_caps_v1();
    boot_counter = os2_boot_counter_next();
    LOG_INF("boot counter=%u resetreas=0x%08x", (unsigned)boot_counter, resetreas_raw);
    NRF_POWER->RESETREAS = resetreas_raw;

#if OS2_ENABLE_TASK_WDT
    wdt_channel = os2_task_wdt_start();
    if (wdt_channel < 0) {
        LOG_ERR("task_wdt init failed rc=%d", wdt_channel);
        return wdt_channel;
    }
    LOG_INF("task_wdt enabled timeout_ms=%u grace_ms=%u",
        OS2_WDT_TIMEOUT_MS, OS2_WDT_DEGRADED_GRACE_MS);
#else
    LOG_WRN("task_wdt disabled via OS2_ENABLE_TASK_WDT=0");
#endif

    os2_try_enable_i2c_pullups();
    k_msleep(50);
    target_count = 0;
    targets[0].name = "fallback";
    targets[0].id = 1;
    targets[0].bus = 0;
    targets[0].addr = 0x68;
    targets[0].reg = 0x75;
    target_count = 1;
    runtimes[0].id = 1;
    LOG_WRN("i2c scan skipped, using fallback bus0:0x68");

    program_size = os2_build_cyclic_program();
    mb_sched_init(&sched);
    vm_pid = mb_sched_spawn(&sched, demo_program, program_size);
    proc = mb_sched_proc(&sched, vm_pid);
    LOG_INF("sched pid=%u prog=%u bytes", vm_pid, (unsigned)program_size);

    while (1) {
        uint32_t now_ms = k_uptime_get_32();
        if ((now_ms - last_pwm_ts) >= OS2_PWM_PERIOD_MS) {
            uint16_t duty = pwm_pattern[pwm_step % ARRAY_SIZE(pwm_pattern)];
            rc = os2_enqueue_pwm_cmd(&sched, vm_pid, OS2_PWM_CHANNEL, duty, OS2_PWM_ACTUATOR_ID, &mb_stats);
            if (rc != MB_OK) {
                LOG_WRN("mailbox full/drop actuator_id=%u rc=%d", OS2_PWM_ACTUATOR_ID, rc);
            } else {
                pwm_step++;
                last_pwm_ts = now_ms;
            }
        }
        for (i = 0; i < target_count; i++) {
            os2_sensor_runtime_t *rt = &runtimes[i];
            int32_t event_mark;
            uint32_t event_ts;

            if (now_ms < rt->backoff_until_ms) {
                continue;
            }

            rc = os2_enqueue_sensor_cmd(&sched, vm_pid, &targets[i], &mb_stats);
            if (rc != MB_OK) {
                LOG_WRN("mailbox full/drop sensor_id=%u rc=%d", targets[i].id, rc);
                continue;
            }

            rc = mb_sched_tick(&sched);
            if (rc != MB_OK && rc != MB_SCHED_IDLE) {
                LOG_ERR("sched failed rc=%d last=%d pc=%u", rc, proc->last_error, (unsigned)proc->pc);
                return rc;
            }

            event_mark = MB_GET_SMALLINT(proc->regs[OS2_REG_EVENT_MARK]);
            event_ts = (uint32_t)MB_GET_SMALLINT(proc->regs[OS2_REG_TS]);

            if (event_mark == MB_CMD_I2C_READ && event_ts != last_ts) {
                const char *name = "unknown";
                int32_t status = OS2_EVENT_STATUS_OK;
                int32_t event_value = MB_GET_SMALLINT(proc->regs[OS2_REG_VALUE]);
                int32_t op_rc = 0;
                uint8_t sensor_id = (uint8_t)MB_GET_SMALLINT(proc->regs[OS2_REG_SENSOR_ID]);
                uint8_t injected_fault = 0;
                os2_sensor_runtime_t *event_rt = NULL;
                size_t j;
                for (j = 0; j < target_count; j++) {
                    if (sensor_id == targets[j].id) {
                        name = targets[j].name;
                        break;
                    }
                }
                event_rt = os2_find_runtime(runtimes, target_count, sensor_id);

#if OS2_FAULT_EVERY_N > 0
                if (event_rt != NULL) {
                    event_rt->read_count++;
                    if ((event_rt->read_count % OS2_FAULT_EVERY_N) == 0U) {
                        event_value = -5;
                        injected_fault = 1;
                    }
                }
#else
                if (event_rt != NULL) {
                    event_rt->read_count++;
                }
#endif

                if (event_value < 0) {
                    op_rc = event_value;
                    status = OS2_EVENT_STATUS_IO_ERROR;
                    if (event_value == -22) {
                        status = OS2_EVENT_STATUS_BAD_ARGUMENT;
                    }
                    if (event_rt != NULL) {
                        event_rt->consecutive_errors++;
                        if (event_rt->consecutive_errors <= OS2_RETRY_LIMIT) {
                            status = OS2_EVENT_STATUS_RETRYING;
                            event_rt->backoff_until_ms = event_ts + OS2_RETRY_BACKOFF_MS;
                        } else {
                            status = OS2_EVENT_STATUS_DEGRADED;
                            if (!event_rt->degraded) {
                                event_rt->degraded_since_ms = event_ts;
                            }
                            event_rt->degraded = 1;
                            event_rt->backoff_until_ms =
                                event_ts + OS2_DEGRADED_BACKOFF_MS;
                        }
                    }
                } else if (event_rt != NULL) {
                    if (event_rt->degraded) {
                        status = OS2_EVENT_STATUS_RECOVERED;
                    }
                    event_rt->degraded = 0;
                    event_rt->consecutive_errors = 0;
                    event_rt->backoff_until_ms = 0;
                    event_rt->degraded_since_ms = 0;
                }

                LOG_INF("event kind=sensor op=i2c_read sensor_id=%d name=%s bus=%d addr=0x%02x reg=0x%02x value=%d rc=%d ts=%u status=%d inj=%u",
                    sensor_id,
                    name,
                    MB_GET_SMALLINT(proc->regs[OS2_REG_EVT_BUS]),
                    MB_GET_SMALLINT(proc->regs[OS2_REG_EVT_ADDR]),
                    MB_GET_SMALLINT(proc->regs[OS2_REG_EVT_REG]),
                    event_value,
                    op_rc,
                    event_ts,
                    status,
                    injected_fault);
                last_ts = event_ts;
                proc->regs[OS2_REG_EVENT_MARK] = MB_MAKE_SMALLINT(MB_CMD_NONE);
                mb_stats.processed++;
            } else if (event_mark == MB_CMD_PWM_SET_DUTY && event_ts != last_ts) {
                int32_t pwm_value = MB_GET_SMALLINT(proc->regs[OS2_REG_VALUE]);
                int32_t status = (pwm_value < 0) ? OS2_EVENT_STATUS_IO_ERROR : OS2_EVENT_STATUS_OK;
                LOG_INF("event kind=actuator op=pwm_set_duty actuator_id=%d sensor_id=%d channel=%d duty_permille=%d value=%d rc=%d ts=%u status=%d inj=0",
                    MB_GET_SMALLINT(proc->regs[OS2_REG_SENSOR_ID]),
                    MB_GET_SMALLINT(proc->regs[OS2_REG_SENSOR_ID]),
                    MB_GET_SMALLINT(proc->regs[OS2_REG_EVT_BUS]),
                    MB_GET_SMALLINT(proc->regs[OS2_REG_EVT_ADDR]),
                    pwm_value,
                    pwm_value,
                    event_ts,
                    status);
                last_ts = event_ts;
                proc->regs[OS2_REG_EVENT_MARK] = MB_MAKE_SMALLINT(MB_CMD_NONE);
                mb_stats.processed++;
            }
        }
        if ((last_ts - last_stats_ts) >= OS2_STATS_LOG_PERIOD_MS) {
            LOG_INF("mb_stats attempted=%u pushed=%u dropped_full=%u processed=%u depth=%u/%u policy=reject_new",
                mb_stats.attempted,
                mb_stats.pushed,
                mb_stats.dropped_full,
                mb_stats.processed,
                (unsigned)proc->mailbox.count,
                (unsigned)MB_MAILBOX_CAPACITY);
            last_stats_ts = last_ts;
        }
#if OS2_ENABLE_TASK_WDT
        if (os2_should_withhold_wdt_feed(runtimes, target_count, k_uptime_get_32())) {
            if (!wdt_feed_blocked) {
                LOG_ERR("sensor degraded beyond grace; withholding task_wdt feed for recovery reboot");
                wdt_feed_blocked = 1;
            }
        } else {
            if (task_wdt_feed(wdt_channel) < 0) {
                LOG_ERR("task_wdt feed failed");
                return -1;
            }
            wdt_feed_blocked = 0;
        }
#endif
        k_msleep(200);
    }

    return 0;
}
